# Project 2:  Lucid Titanic Sleuthing

## Part 1: Developing an understanding of the data

#### Based on the description of the data you read in the readme describe in your own words this data.

Titanic DataFrame: 
info on 1309 Passengers Only
info entails: 
'pclass':        Passenger Class socioeconomic 1~upper 2~middle 3~lower
'survived':      Survival 1=YES 0=NO
'name':          name of passenger
'sex':           Female or Male
'age':           Age in years, fractional if less than 1
                 If the age is estimated, it is in the form xx.5
'sibsp':         Number of siblings and spouses on board
'parch':         Number of parents and children on board
'ticket':        Nicket Number
'fare':          Ticket Fare
'cabin':         Cabin Bumber
'embarked':      Port Passenger Embarked (C = Cherbourg; Q = Queenstown; S = Southampton) 
'boat':          Lifeboat Identification
'body':          Body Identificaiton Number 
'home.dest':     Destination


Lusitania DataFrame:
info on 1961 Passengers and Crews
info entails: 
'Family name':                           Last Name
'Title':                                 Title
'Personal name':                         First Name
'Fate':                                  Survaival Lost or Saved
'Age':                                   Age in years Children under 2 in                                          -months and Infants
'Department/Class':                      Crew Department Passenger Class 
Band Deck Engineering Victualling Stowaway  
Saloon=1st Class Second Class Third Class     

'Passenger/Crew':                        Passenger or Crew
'Citizenship':                           Citizen Country
'Position':                              Position of Crew Member            
'Status':                                Marital Status
'City':                                  City of origin
'County':                                County of origin
'State':                                 State of origin
'Country':                               Country of origin
'Lifeboat':                              Lifeboat
'Rescue Vessel':                         Rescue Vessel
'Body No.':                              Body Identification Number
'Ticket No.':                            Ticket Identification Number
'Cabin No.':                             Cabin Number
'Traveling Companions and other notes':  Traveling Companions
'Value':                                 Corrosponds to Fate 0=NO 1=YES
'Adult/Minor':                           Age < 18 Minor => 18 Adult
'Sex':                                   Male/Female

#### Based on our conceptual understanding of the columns in this data set.  What are the reasonable range of the values for the Sex, Age, SibSp, Parch columns.

Sex = Male/Female 
Age = 0 to 100 
SibSp = 0 to 10
ParCh = 0 to 10

### Open the data in sublime text is there anything that jumps out to you?

Lusitania has much more information than Titanic. Lusitania looks more like raw data.

## Part 2: reading the data in

#### Now read the data into a Pandas DataFrame

In [1]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('./assets/titanic.csv')
lusit = pd.read_csv('./assets/lusitania.csv')

#### Check that the age column doesn't have any unreasonable values

In [2]:
titanic['age'].unique()

array([ 29.  ,   0.92,   2.  ,  30.  ,  25.  ,  48.  ,  63.  ,  39.  ,
        53.  ,  71.  ,  47.  ,  18.  ,  24.  ,  26.  ,  80.  ,    nan,
        50.  ,  32.  ,  36.  ,  37.  ,  42.  ,  19.  ,  35.  ,  28.  ,
        45.  ,  40.  ,  58.  ,  22.  ,  41.  ,  44.  ,  59.  ,  60.  ,
        33.  ,  17.  ,  11.  ,  14.  ,  49.  ,  76.  ,  46.  ,  27.  ,
        64.  ,  55.  ,  70.  ,  38.  ,  51.  ,  31.  ,   4.  ,  54.  ,
        23.  ,  43.  ,  52.  ,  16.  ,  32.5 ,  21.  ,  15.  ,  65.  ,
        28.5 ,  45.5 ,  56.  ,  13.  ,  61.  ,  34.  ,   6.  ,  57.  ,
        62.  ,  67.  ,   1.  ,  12.  ,  20.  ,   0.83,   8.  ,   0.67,
         7.  ,   3.  ,  36.5 ,  18.5 ,   5.  ,  66.  ,   9.  ,   0.75,
        70.5 ,  22.5 ,   0.33,   0.17,  40.5 ,  10.  ,  23.5 ,  34.5 ,
        20.5 ,  30.5 ,  55.5 ,  38.5 ,  14.5 ,  24.5 ,  60.5 ,  74.  ,
         0.42,  11.5 ,  26.5 ])

In [3]:
lusit['Age'].unique()

array(['38', '37', '30', '25', '27', '48', nan, '24', '19 ?', '57', '50',
       '56', '41', '19', '33', '29', '18', '20', '21', '26', '17', '58',
       '47', '54', '35', '43', '59', '53', '44', '51', '40', '49', '42',
       '32', '31', '34', '22', '45', '36', '29 ?', '52', '23', '60', '28',
       '16', '46', '15', '39', '63 ?', '55', '64', '53 ?', '09-months',
       '6', '9', '14', '10', '12', '?', '62', '5', '8', '65', '68', '76',
       '61', '63', '03-months', '1.5', '2.5', '18-months', '3', '2',
       '25 ?', '08-months', '4', '15-months', '14-months', 'Infant',
       '3-6-months ?', '51 or 47', '45 or 51', '22 (?)', '17-months',
       '13-months', '02-months', '49 ?', '05-months', '11', '59 (64?)',
       '63 (51?)', '37 (39?)', '32 (22?)', '31 (32?)', '24 (23?)', '27?',
       '7', '42?', '31 ?', '10-months', '38 (?)', '70', '62 (?)',
       '06-months', '13', '2_', '11-months', '30 ?', '34?', '1',
       '39 (47?)', '67', '73', '72', '11-months (3?)', '4.25', '69', '26?',
       '54?', '21?', '16 ?'], dtype=object)

In [4]:
lusit['Clean_Age'] = lusit['Age'].dropna()
lusit['Clean_Age'] = lusit['Clean_Age'].str.replace(' \?','')
lusit['Clean_Age'].unique()

array(['38', '37', '30', '25', '27', '48', nan, '24', '19', '57', '50',
       '56', '41', '33', '29', '18', '20', '21', '26', '17', '58', '47',
       '54', '35', '43', '59', '53', '44', '51', '40', '49', '42', '32',
       '31', '34', '22', '45', '36', '52', '23', '60', '28', '16', '46',
       '15', '39', '63', '55', '64', '09-months', '6', '9', '14', '10',
       '12', '?', '62', '5', '8', '65', '68', '76', '61', '03-months',
       '1.5', '2.5', '18-months', '3', '2', '08-months', '4', '15-months',
       '14-months', 'Infant', '3-6-months', '51 or 47', '45 or 51',
       '22 (?)', '17-months', '13-months', '02-months', '05-months', '11',
       '59 (64?)', '63 (51?)', '37 (39?)', '32 (22?)', '31 (32?)',
       '24 (23?)', '27?', '7', '42?', '10-months', '38 (?)', '70',
       '62 (?)', '06-months', '13', '2_', '11-months', '34?', '1',
       '39 (47?)', '67', '73', '72', '11-months (3?)', '4.25', '69', '26?',
       '54?', '21?'], dtype=object)

In [5]:
lusit['Clean_Age'] = lusit['Clean_Age'].str.replace(' \(...\)?','')
lusit['Clean_Age'] = lusit['Clean_Age'].str.replace(' \(.\)?','')
lusit['Clean_Age'] = lusit['Clean_Age'].str.replace(' .. ..','')
#since we don't have any 0s in our data, replace ? with 0 below
lusit['Clean_Age'] = lusit['Clean_Age'].str.replace('\?','0')
lusit['Clean_Age'] = lusit['Clean_Age'].str.replace('\_','')
lusit['Clean_Age'].unique()

array(['38', '37', '30', '25', '27', '48', nan, '24', '19', '57', '50',
       '56', '41', '33', '29', '18', '20', '21', '26', '17', '58', '47',
       '54', '35', '43', '59', '53', '44', '51', '40', '49', '42', '32',
       '31', '34', '22', '45', '36', '52', '23', '60', '28', '16', '46',
       '15', '39', '63', '55', '64', '09-months', '6', '9', '14', '10',
       '12', '0', '62', '5', '8', '65', '68', '76', '61', '03-months',
       '1.5', '2.5', '18-months', '3', '2', '08-months', '4', '15-months',
       '14-months', 'Infant', '3-6-months', '17-months', '13-months',
       '02-months', '05-months', '11', '270', '7', '420', '10-months',
       '70', '06-months', '13', '11-months', '340', '1', '67', '73', '72',
       '4.25', '69', '260', '540', '210'], dtype=object)

In [6]:
#any age with months changed to 1
lusit['Clean_Age'] = lusit['Clean_Age'].str.replace('..-months','1')
lusit['Clean_Age'] = lusit['Clean_Age'].str.replace('Infant','.1')
lusit['Clean_Age'].unique()

array(['38', '37', '30', '25', '27', '48', nan, '24', '19', '57', '50',
       '56', '41', '33', '29', '18', '20', '21', '26', '17', '58', '47',
       '54', '35', '43', '59', '53', '44', '51', '40', '49', '42', '32',
       '31', '34', '22', '45', '36', '52', '23', '60', '28', '16', '46',
       '15', '39', '63', '55', '64', '1', '6', '9', '14', '10', '12', '0',
       '62', '5', '8', '65', '68', '76', '61', '1.5', '2.5', '3', '2', '4',
       '.1', '11', '270', '7', '420', '70', '13', '340', '67', '73', '72',
       '4.25', '69', '260', '540', '210'], dtype=object)

In [7]:
lusit['Clean_Age'] = lusit['Clean_Age'].astype(float)

In [8]:
lusit['Clean_Age'].describe()

/Users/Leyla/anaconda/lib/python2.7/site-packages/numpy/lib/function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

count    1308.000000
mean       33.683524
std        26.386535
min         0.000000
25%              NaN
50%              NaN
75%              NaN
max       540.000000
Name: Clean_Age, dtype: float64

In [9]:
titanic['age'].describe()

count    1046.000000
mean       29.881138
std        14.413493
min         0.170000
25%              NaN
50%              NaN
75%              NaN
max        80.000000
Name: age, dtype: float64

#### Check for missing values.  How do you know that a value is missing?

In [10]:
def missing_values(data):
    for column in data.columns.values:
        is_null = pd.isnull(data[column])
        print {column:len(is_null[is_null])}
        
missing_values(titanic)

{'pclass': 0}
{'survived': 0}
{'name': 0}
{'sex': 0}
{'age': 263}
{'sibsp': 0}
{'parch': 0}
{'ticket': 0}
{'fare': 1}
{'cabin': 1014}
{'embarked': 2}
{'boat': 823}
{'body': 1188}
{'home.dest': 564}

In [11]:
missing_values(lusit)

{'Family name': 0}
{'Title': 0}
{'Personal name': 3}
{'Fate': 0}
{'Age': 653}
{'Department/Class': 0}
{'Passenger/Crew': 0}
{'Citizenship': 2}
{'Position': 1270}
{'Status': 1166}
{'City': 682}
{'County': 1890}
{'State': 929}
{'Country': 638}
{'Lifeboat': 1829}
{'Rescue Vessel': 1810}
{'Body No.': 1750}
{'Ticket No.': 1677}
{'Cabin No.': 1632}
{'Traveling Companions and other notes': 1363}
{'Value': 0}
{'Adult/Minor': 0}
{'Sex': 0}
{'Clean_Age': 653}

#### Does it makes sense to guess at the value?

Yes. Too much of our data will be lost if we drop all the people without age.

## Part 3: data imputation

#### Well let’s say that it does... You likely noticed that Age has some missing values. How many are missing?

titanic has 263 missing values lusitania has 653 missing values

#### For the Age of the passangers ... how would you guess at the missing values using the other data present in the CSV.

I thought to utilize titles to guess the missing age values. Titanic doesn't have title column like lusitania and in order to create one it has to be extracted from the name. Once created we can make a better guess on missing values by grouping the ages. Mr. range from 20s - 30s Sir. 40s - 70s and so on.

In [12]:
titanic['adult/minor'] = titanic.age.apply(lambda x: 'minor' if x < 18 else 'adult')

In [13]:
titanic.pivot_table(index='adult/minor', values='age', aggfunc='mean', dropna=True)

adult/minor
adult    33.468610
minor     9.101753
Name: age, dtype: float64

In [14]:
titanic['title'] = titanic.name.str.extract(',[\s](\D+\.)', expand=True)

titanic.title.unique()

array(['Miss.', 'Master.', 'Mr.', 'Mrs.', 'Col.', 'Mme.', 'Dr.', 'Major.',
       'Capt.', 'Lady.', 'Sir.', 'Mlle.', 'Dona.', 'Jonkheer.',
       'the Countess.', 'Mrs. Martin (Elizabeth L.', 'Don.', 'Rev.', 'Ms.'], dtype=object)

In [15]:
titanic['title'] = titanic['title'].str.replace('Mrs\. Martin \(Elizabeth L\.', 'Mrs.')
titanic['title'] = titanic['title'].str.replace('Mlle\.', 'Miss.')
titanic['title'] = titanic['title'].str.replace('Mme\.', 'Miss.')
titanic['title'] = titanic['title'].str.replace('Jonkheer\.', 'Mr.')
titanic['title'] = titanic['title'].str.replace('Don\.', 'Sir.')
titanic['title'] = titanic['title'].str.replace('Dr\.', 'Sir.')
titanic['title'] = titanic['title'].str.replace('Dona\.', 'Mrs.')
titanic['title'] = titanic['title'].str.replace('Major\.', 'Sir.')
titanic['title'] = titanic['title'].str.replace('Rev\.', 'Sir.')
titanic['title'] = titanic['title'].str.replace('Capt\.', 'Sir.')
titanic['title'] = titanic['title'].str.replace('Col\.', 'Sir.')
titanic['title'] = titanic['title'].str.replace('the Countess\.', 'Mrs.')

In [16]:
titanic.pivot_table(index=['title'], values=['age'], aggfunc='mean', dropna=True)

               age
title
Lady.    48.000000
Master.   5.482642
Miss.    21.805587
Mr.      32.262027
Mrs.     36.982558
Ms.      28.000000
Sir.     46.125000

In [17]:
mask = titanic[titanic['age'].isnull()]

mask.groupby(['title'])['title'].count()

title
Master.      8
Miss.       50
Mr.        176
Mrs.        27
Ms.          1
Sir.         1
Name: title, dtype: int64

In [18]:
titanic.loc[mask[mask['title'] == 'Master.']['age'].index.tolist(),'age'] = 5

In [19]:
titanic.loc[mask[mask['title'] == 'Miss.']['age'].index.tolist(),'age'] = 21

In [20]:
titanic.loc[mask[mask['title'] == 'Mr.']['age'].index.tolist(),'age'] = 32

In [21]:
titanic.loc[mask[mask['title'] == 'Mrs.']['age'].index.tolist(),'age'] = 36

In [22]:
titanic.loc[mask[mask['title'] == 'Ms.']['age'].index.tolist(),'age'] = 28

In [23]:
titanic.loc[mask[mask['title'] == 'Sir.']['age'].index.tolist(),'age'] = 46

In [24]:
#LUSITANIA

In [25]:
lusit['Title'].unique()

array(['Mr.', 'Dr.', 'Master', 'Captain', 'Mrs.', 'Lady', 'Miss',
       'Reverend', 'Professor', 'Sir', 'Lieutenant', 'Father',
       'Mr. (later Sir)', 'Surgeon-Major', 'Detective-Inspector',
       'Commander', 'Sister', 'Mr. ', 'Master (?)'], dtype=object)

In [26]:
lusit['Title'] = lusit['Title'].str.replace('Mr\. \(later Sir\)','Sir')
lusit['Title'] = lusit['Title'].str.replace('Mr\. ','Sir')
lusit['Title'] = lusit['Title'].str.replace('Dr\.','Mr.')
lusit['Title'] = lusit['Title'].str.replace('Professor','Mr.')
lusit['Title'] = lusit['Title'].str.replace('Commander','Sir')
lusit['Title'] = lusit['Title'].str.replace('Reverend','Sir')
lusit['Title'] = lusit['Title'].str.replace('Surgeon-Major','Sir')
lusit['Title'] = lusit['Title'].str.replace('Detective\-Inspector','Sir')
lusit['Title'] = lusit['Title'].str.replace('Lieutenant','Mr.')
lusit['Title'] = lusit['Title'].str.replace('Father','Sir')
lusit['Title'] = lusit['Title'].str.replace('Captain','Mr.')
lusit['Title'] = lusit['Title'].str.replace('Sister','Lady')
lusit['Title'] = lusit['Title'].str.replace(' \(.\)','')
lusit['Title'].unique()

array(['Mr.', 'Master', 'Mrs.', 'Lady', 'Miss', 'Sir'], dtype=object)

In [27]:
lusit.pivot_table(index=['Title'], values=['Clean_Age'], aggfunc='mean', dropna=True)

        Clean_Age
Title
Lady    44.333333
Master   6.180526
Miss    24.170352
Mr.     36.664748
Mrs.    39.193277
Sir     47.666667

In [28]:
#I made one age 0 where she is a Miss.
lusit.loc[lusit[lusit['Clean_Age']==0].index.tolist(),'Clean_Age'] = 24

In [29]:
mask = lusit[lusit['Clean_Age'].isnull()]

mask.groupby(['Title'])['Title'].count()

Title
Master      5
Miss       39
Mr.       362
Mrs.       39
Sir       208
Name: Title, dtype: int64

In [30]:
lusit.loc[mask[mask['Title'] == 'Master']['Clean_Age'].index.tolist(),'Clean_Age'] = 6

In [31]:
lusit.loc[mask[mask['Title'] == 'Miss']['Clean_Age'].index.tolist(),'Clean_Age'] = 24

In [32]:
lusit.loc[mask[mask['Title'] == 'Mr.']['Clean_Age'].index.tolist(),'Clean_Age'] = 36

In [33]:
lusit.loc[mask[mask['Title'] == 'Mrs.']['Clean_Age'].index.tolist(),'Clean_Age'] = 39

In [34]:
lusit.loc[mask[mask['Title'] == 'Sir']['Clean_Age'].index.tolist(),'Clean_Age'] = 47

## Part 4: Group Statistics

#### Are there any groups that were especially adversely affected in the Titanic wreck? (justify your response numerically)

2nd class male and 3rd class male with ~ 0.15 survival rate

In [39]:
titanic['deceased'] = titanic['survived'].apply(lambda x: 1 if x == 0 else 0)
titanic['all'] = titanic['survived'] + titanic['deceased']
titanic['survival_rate'] = titanic['survived']/titanic['all']

from collections import OrderedDict
titanic.groupby(['pclass','sex']).agg(OrderedDict([('deceased', 'sum'),
                                                              ('survived', 'sum'),
                                                              ('all', 'sum'),
                                                              ('survival_rate', 'mean')]))

               deceased  survived  all  survival_rate
pclass sex
1      female         5       139  144       0.965278
       male         118        61  179       0.340782
2      female        12        94  106       0.886792
       male         146        25  171       0.146199
3      female       110       106  216       0.490741
       male         418        75  493       0.152130

In [44]:
table = pd.crosstab(titanic['sex'],titanic['survived'])
table

survived    0    1
sex
female    127  339
male      682  161

In [45]:
from scipy.stats import chi2_contingency

chi2, pvalue, dof, expected = chi2_contingency(table)
pvalue

4.5899249369529454e-81

In [46]:
table = pd.crosstab(titanic['pclass'],titanic['survived'])
table

survived    0    1
pclass
1         123  200
2         158  119
3         528  181

In [47]:
chi2, pvalue, dof, expected = chi2_contingency(table)
pvalue

1.7208259588256175e-28

In [55]:
table = pd.crosstab(titanic['title'],titanic['survived'])
table

survived    0    1
title
Lady.       0    1
Master.    30   31
Miss.      84  179
Mr.       635  123
Mrs.       42  157
Ms.         1    1
Sir.       17    8

In [56]:
chi2, pvalue, dof, expected = chi2_contingency(table)
pvalue

2.5001057472885931e-83

In [48]:
titanic.groupby(['pclass','sex','embarked']).agg(OrderedDict([('deceased', 'sum'),
                                                              ('survived', 'sum'),
                                                              ('all', 'sum'),
                                                              ('survival_rate', 'mean')]))

                        deceased  survived  all  survival_rate
pclass sex    embarked
1      female C                2        69   71       0.971831
              Q                0         2    2       1.000000
              S                3        66   69       0.956522
       male   C               42        28   70       0.400000
              Q                1         0    1       0.000000
              S               75        33  108       0.305556
2      female C                0        11   11       1.000000
              Q                0         2    2       1.000000
              S               12        81   93       0.870968
       male   C               12         5   17       0.294118
              Q                5         0    5       0.000000
              S              129        20  149       0.134228
3      female C                9        22   31       0.709677
              Q               23        33   56       0.589286
              S               78        51  129       0.395349
       male   C               55        15   70       0.214286
              Q               50         7   57       0.122807
              S              313        53  366       0.144809

#### Are there any groups that outperformed the survival of the latter group? (justify your response numerically)

first class female with ~ 0.97 survival_rate

## Part 5:  Comparative Statistics:  Lusitania

#### Are there any groups that were especially adversely affected in the Titanic wreck? (justify your response numerically)

Stowaway and lower class British Seaman passengers with 0 survival rate 
lower class male passenger, female crew victualling, and male crew engineering with ~0.36 survival rate

In [58]:
lusit['Lost'] = lusit['Fate'].apply(lambda x: 1 if x == 'Lost' else 0)
lusit['Not on board'] = lusit['Fate'].apply(lambda x: 1 if x == 'Not on board' else np.nan)
lusit['Saved'] = lusit['Fate'].apply(lambda x: 1 if x == 'Saved' else 0)
lusit['Saved (died from trauma)'] = lusit['Fate'].apply(lambda x: 1 if x == 'Saved (died from trauma)' else np.nan)
lusit['All'] = lusit['Value']
lusit['Survival Rate'] = (lusit['All']-lusit['Lost'])/lusit['All']

In [59]:
lusit.groupby(['Sex','Passenger/Crew','Department/Class']).agg(OrderedDict([('Lost', 'sum'),
                                                                            ('Not on board', 'sum'),
                                                                            ('Saved', 'sum'),
                                                                            ('Saved (died from trauma)', 'sum'),
                                                                            ('All', 'count'),
                                                                            ('Survival Rate', 'mean')
                                                              ]))

                                                         Lost  Not on board  \
Sex    Passenger/Crew Department/Class
Female Crew           Victualling                          16           NaN
       Passenger      Saloon                               56           1.0
                      Second                              185           NaN
                      Third                                68           NaN
Male   Crew           Band                                  2           NaN
                      Deck                                 32           NaN
                      Engineering                         201           NaN
                      Victualling                         151           NaN
       Passenger      Saloon                              121           NaN
                      Second                              187           NaN
                      Third                               168           NaN
                      Third (Distressed British Seaman)     3           NaN
       Stowaway       Stowaway                              3           NaN

                                                         Saved  \
Sex    Passenger/Crew Department/Class
Female Crew           Victualling                            9
       Passenger      Saloon                                34
                      Second                               108
                      Third                                 40
Male   Crew           Band                                   3
                      Deck                                  37
                      Engineering                          112
                      Victualling                          129
       Passenger      Saloon                                78
                      Second                               119
                      Third                                 94
                      Third (Distressed British Seaman)      0
       Stowaway       Stowaway                               0

                                                         Saved (died from trauma)  \
Sex    Passenger/Crew Department/Class
Female Crew           Victualling                                             NaN
       Passenger      Saloon                                                  NaN
                      Second                                                  1.0
                      Third                                                   NaN
Male   Crew           Band                                                    NaN
                      Deck                                                    NaN
                      Engineering                                             NaN
                      Victualling                                             1.0
       Passenger      Saloon                                                  1.0
                      Second                                                  1.0
                      Third                                                   NaN
                      Third (Distressed British Seaman)                       NaN
       Stowaway       Stowaway                                                NaN

                                                         All  Survival Rate
Sex    Passenger/Crew Department/Class
Female Crew           Victualling                         25       0.360000
       Passenger      Saloon                              91       0.377778
                      Second                             294       0.370748
                      Third                              108       0.370370
Male   Crew           Band                                 5       0.600000
                      Deck                                69       0.536232
                      Engineering                        313       0.357827
                      Victualling                        281       0.462633
       Passenger      Saloon                             200       0.395000
                      Second                             307       0.390879
                      Third                              262       0.358779
                      Third (Distressed British Seaman)    3       0.000000
       Stowaway       Stowaway                             3       0.000000

In [64]:
table = pd.crosstab(lusit['Sex'],lusit['Saved'])
table

Saved     0    1
Sex
Female  327  191
Male    871  572

In [65]:
chi2, pvalue, dof, expected = chi2_contingency(table)
pvalue

0.29118207614691405

In [66]:
table = pd.crosstab(lusit['Title'],lusit['Saved'])
table

Saved     0    1
Title
Lady      1    2
Master   65   35
Miss    154   84
Mr.     650  407
Mrs.    172  105
Sir     156  130

In [67]:
chi2, pvalue, dof, expected = chi2_contingency(table)
pvalue

0.14204988295663026

#### Are there any groups that outperformed the survival of the latter group? (justify your response numerically)

male crew band with ~0.60 survival rate and male crew deck with ~0.54 survival rate

In [ ]:
lusit.groupby(['Adult/Minor']).agg(OrderedDict([('Lost', 'sum'),
                                                                            ('Not on board', 'sum'),
                                                                            ('Saved', 'sum'),
                                                                            ('Saved (died from trauma)', 'sum'),
                                                                            ('All', 'count'),
                                                                            ('Survival Rate', 'mean')
                                                              ]))

#### What does the group-wise survival rate imply about circumstances during these two accidents?

The results imply that in the Lusitania accident women and children where not considered; Survival rate of the crew in Lusitania much higher than it's passengers. Where as most of the survivors from Titanic were women and children.